## Datos del Titanic

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
titanic = pd.read_csv('C:/Users/Alvaro/Documents/GitHub/r-basic_Rstudio/seaborn-data/titanic.csv')

In [6]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Para convertir una variable a categorica

In [23]:
titanic['survived'] = pd.Categorical(titanic['survived'])
titanic['pclass'] = pd.Categorical(titanic['pclass'])
titanic['sex'] = pd.Categorical(titanic['sex'])
titanic['alone'] = pd.Categorical(titanic['alone'])
titanic['class'] = pd.Categorical(titanic['class'])
titanic['alive'] = pd.Categorical(titanic['alive'])
titanic['embark_town'] = pd.Categorical(titanic['embark_town'])
titanic['embarked'] = pd.Categorical(titanic['embarked'])
titanic['who'] = pd.Categorical(titanic['who'])

In [24]:
titanic.dtypes

survived       category
pclass         category
sex            category
age             float64
sibsp             int64
parch             int64
fare            float64
embarked       category
class          category
who            category
adult_male         bool
deck             object
embark_town    category
alive          category
alone          category
dtype: object

## Tablas de contingencia de una variable

In [26]:
tabla_contingencia = pd.crosstab(index=titanic['survived'], columns='Pasajeros')
tabla_contingencia

col_0     Pasajeros
survived
0               549
1               342

In [30]:
pd.crosstab(index=titanic['class'], columns='Pasajeros')

col_0   Pasajeros
class
First         216
Second        184
Third         491

In [31]:
pd.crosstab(index= titanic['deck'],
           columns = 'count')

col_0  count
deck
A         15
B         47
C         59
D         33
E         32
F         13
G          4

## Tabla de frecuencias relativas

In [32]:
tabla_cabinas = pd.crosstab(index=titanic['deck'], columns= 'Count')

In [33]:
tabla_cabinas/tabla_cabinas.sum()

col_0     Count
deck
A      0.073892
B      0.231527
C      0.290640
D      0.162562
E      0.157635
F      0.064039
G      0.019704

In [35]:
tabla_sexo = pd.crosstab(index=titanic['sex'], columns='Pasajeros')

In [36]:
tabla_sexo/tabla_sexo.sum()

col_0   Pasajeros
sex
female   0.352413
male     0.647587

In [37]:
tabla_supervivientes = pd.crosstab(index=titanic['survived'], columns='Pasajeros')

In [38]:
tabla_supervivientes/tabla_supervivientes.sum()

col_0     Pasajeros
survived
0          0.616162
1          0.383838

## Tabla de contingencia de dos variables

In [41]:
supervivientes_genero = pd.crosstab(index=titanic['survived'],
                                   columns = titanic['sex'])
supervivientes_genero.index = ['Murió', 'Sobrevivió']
supervivientes_genero

sex         female  male
Murió           81   468
Sobrevivió     233   109

In [48]:
survived_class = pd.crosstab(index=titanic['survived'],
                            columns = titanic['pclass'], margins = True)
survived_class.index = ['Murió', 'Sobrevivió', 'Total por clase']
survived_class.columns = ['Primera Clase', 'Segunda Clase', 'Tercera Clase', 'Total por supervivencia']
survived_class

,Primera Clase,Segunda Clase,Tercera Clase,Total por supervivencia
Murió,80,97,372,549
Sobrevivió,136,87,119,342
Total por clase,216,184,491,891

## Frecuencias relativas globales

In [53]:
round(survived_class/survived_class.loc['Total por clase', 'Total por supervivencia'], 2)

,Primera Clase,Segunda Clase,Tercera Clase,Total por supervivencia
Murió,0.09,0.11,0.42,0.62
Sobrevivió,0.15,0.10,0.13,0.38
Total por clase,0.24,0.21,0.55,1.00

## Frecuencias relativas marginales

In [55]:
round(survived_class/survived_class.loc['Total por clase'], 2)

,Primera Clase,Segunda Clase,Tercera Clase,Total por supervivencia
Murió,0.37,0.53,0.76,0.62
Sobrevivió,0.63,0.47,0.24,0.38
Total por clase,1.00,1.00,1.00,1.00

In [63]:
survived_class.div(survived_class.loc['Total por clase'], axis= 1) #Lo mismo pero empleando otra sintaxis

,Primera Clase,Segunda Clase,Tercera Clase,Total por supervivencia
Murió,0.37037,0.527174,0.757637,0.616162
Sobrevivió,0.62963,0.472826,0.242363,0.383838
Total por clase,1.00000,1.000000,1.000000,1.000000

In [60]:
survived_class.T/survived_class['Total por supervivencia'] # Es lo mismo que la siguiente ventana

                            Murió  Sobrevivió  Total por clase
Primera Clase            0.145719    0.397661         0.242424
Segunda Clase            0.176685    0.254386         0.206510
Tercera Clase            0.677596    0.347953         0.551066
Total por supervivencia  1.000000    1.000000         1.000000

In [61]:
survived_class.div(survived_class['Total por supervivencia'], axis= 0) #Lo mismo de antes pero conservando la estructura

,Primera Clase,Segunda Clase,Tercera Clase,Total por supervivencia
Murió,0.145719,0.176685,0.677596,1.0
Sobrevivió,0.397661,0.254386,0.347953,1.0
Total por clase,0.242424,0.206510,0.551066,1.0

## Tablas multidimensionales

Recuerda que son dificiles de leer e interpretar

In [66]:
surv_sex_class = pd.crosstab(index=titanic['survived'],
                            columns = [titanic['sex'], titanic['class']],
                            margins = True)
surv_sex_class

sex      female               male               All
class     First Second Third First Second Third
survived
0             3      6    72    77     91   300  549
1            91     70    72    45     17    47  342
All          94     76   144   122    108   347  891

In [67]:
surv_sex_class['female']

class     First  Second  Third
survived
0             3       6     72
1            91      70     72
All          94      76    144

In [68]:
surv_sex_class['female']['First']

survived
0       3
1      91
All    94
Name: First, dtype: int64